

#include ".\main\main.h"




volatile uint8_t ht1621_buff[6];

/****************************************************************/
//函数名：
//功  能：
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_init(void)
{
	lcd_write_comm(COMM_SYS_EN);
	lcd_write_comm(COMM_RC_OSC);
	lcd_write_comm(COMM_BAIS_DUTY);
	lcd_write_comm(LCD_DISP_ON);
	SET_LCD_BLC;
}
/****************************************************************/
//函数名：
//功  能：LCD屏写入一帧结束标记
//参  数：无
//返回值：无
/****************************************************************/
void lcd_input_over(void)
{
	SET_LCD_CLK;
	_nop_();
	SET_LCD_CS;
	_nop_();
}
/****************************************************************/
//函数名：
//功  能：写数据(防中断)数据,8位
//参  数：无
//返回值：无
/****************************************************************/
void lcd_write_byte(uint8_t dat)
{
	EA=0;
	ht1621_write_byte(dat);
	EA=1;
}

/****************************************************************/
//函数名：
//功  能：写数据(防中断)数据,高四位
//参  数：无
//返回值：无
/****************************************************************/
void lcd_write_data(uint8_t dat)
{
	EA=0;
	ht1621_write_data(dat);
	EA=1;
}
/****************************************************************/
//函数名：
//功  能：写数据地址(防中断)
//参  数：dat数据地址,低六位起始地址
//返回值：无
/****************************************************************/
void lcd_write_add(uint8_t dat)
{
	EA=0;
	ht1621_write_dat_id();
	ht1621_write_add(dat);
	EA=1;
}
/****************************************************************/
//函数名：
//功  能：写命令(防中断)
//参  数：无
//返回值：无
/****************************************************************/
void lcd_write_comm(uint8_t com)
{
	EA=0;
	ht1621_write_com_id();
	ht1621_set_comm(com);
	EA=1;
}

/****************************************************************/
//函数名：
//功  能：写单字节指令全
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_set_comm(uint8_t com)
{
	ht1621_write_com(com);
	RESET_LCD_CLK;
	_nop_();
	SET_LCD_CLK;
	_nop_();
	SET_LCD_CS;
	_nop_();
}

/****************************************************************/
//函数名：
//功  能：
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_byte(uint8_t dat)
{
	RESET_LCD_CS;
	ht1621_write_bit(8,dat);
}
/****************************************************************/
//函数名：
//功  能：
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_com(uint8_t com)
{
	RESET_LCD_CS;
	ht1621_write_bit(8,com);
}

/****************************************************************/
//函数名：
//功  能：写四位数据,内容高四位,向左移位
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_data(uint8_t dat)
{
	RESET_LCD_CS;
	ht1621_write_bit(4,dat);
}

/****************************************************************/
//函数名：
//功  能：写数据ID,高三位数据,低六位起始地址,ID:101,低六位起始地址
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_add(uint8_t dat)
{
	RESET_LCD_CS;
	ht1621_write_bit(6,dat);
}
/****************************************************************/
//函数名：
//功  能：写三位命令ID:100,写命令,dat内容高三位,向左移位
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_com_id(void)
{
	uint8_t com;
	
	com=COMM_ID;
	ht1621_write_id(com);
}
/****************************************************************/
//函数名：
//功  能：写三位命令ID:101,写数据,dat内容高三位,向左移位
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_dat_id(void)
{
	uint8_t dat;
	
	dat=DATA_ID;
	ht1621_write_id(dat);
}

/****************************************************************/
//函数名：
//功  能：写三位ID,dat内容高三位,向左移位
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_id(uint8_t dat)
{
	RESET_LCD_CS;
	ht1621_write_bit(3,dat);
}
/****************************************************************/
//函数名：
//功  能：写num位,dat内容向左移num位
//参  数：无
//返回值：无
/****************************************************************/
void ht1621_write_bit(uint8_t num,uint8_t dat)
{
	uint8_t i;
	
	for(i=0;i<num;i++)
	{
		RESET_LCD_CLK;
		_nop_();
		if(dat&0x80)
			SET_LCD_DAT;
		else
			RESET_LCD_DAT;
		_nop_();
		SET_LCD_CLK;
		
		dat=dat<<1;
	}
}




