
#include ".\main\main.h"



//////////////////////////////////////.egfdcba	//cct信息段码转换对应
uint8_t code lcd_num0[]={0x5f,		//01011111B		;0
						0x06,		//00000110B		;1
						0x6b,		//01101011B		;2
						0x2f,		//00101111B		;3
						0x36,		//00110110B		;4
						0x3d,		//00111101B		;5
						0x7d,		//01111101B		;6
						0x07,		//00000111B		;7
						0x7f,		//01111111B		;8
						0x3f,		//00111111B		;9
						0x77,		//01110111B		;A
						0x7c,		//01111100B		;B
						0x59,		//01011001B		;C
						0x6e,		//01101110B		;D
						0x79,		//01111001B		;E
						0x71,		//01110001B		;F
						0x00		//00000000B		;0x10灭
						};
//////////////////////////////////////abcd.fge	//lm信息段码转换对应
uint8_t code lcd_num1[]={0xf5,		//11110101B		;0
						0x60,		//01100000B		;1
						0xd3,		//11010011B		;2
						0xf2,		//11110010B		;3
						0x66,		//01100110B		;4
						0xb6,		//10110110B		;5
						0xb7,		//10110111B		;6
						0xe0,		//11100000B		;7
						0xf7,		//11110111B		;8
						0xf6,		//11110110B		;9
						0xe7,		//11100111B		;A
						0x37,		//00110111B		;B
						0x95,		//10010101B		;C
						0x73,		//01110011B		;D
						0x97,		//10010111B		;E
						0x87,		//10000111B		;F
						0x00		//00000000B		;0x10灭
						};

volatile uint8_t cct_buff[4];	//cct信息存储单元
volatile uint8_t lm_buff[3];		//lm信息存储单元

/****************************************************************/
//函数名：
//功  能：清屏
//参  数：无
//返回值：无
/****************************************************************/
void lcd_clr_screen(void)
{
	uint8_t i;
	
	lcd_write_add(COMM_ST_ADDRESS);
	for(i=0;i<12;i++)
	{
		lcd_write_data(0);
	}
	lcd_input_over();
}
/****************************************************************/
//函数名：
//功  能：显示全屏
//参  数：无
//返回值：无
/****************************************************************/
void lcd_disp_screen(void)
{
	uint8_t i;
	
	lcd_write_add(COMM_ST_ADDRESS);
	for(i=0;i<12;i++)
	{
		lcd_write_data(0xff);
	}
	lcd_input_over();
}
/****************************************************************/
//函数名：
//功  能：显示全屏信息ht1621_buff[]中6个字节
//参  数：无
//返回值：无
/****************************************************************/
void lcd_disp_info(void)
{
	uint8_t i,j;
	
	lcd_write_add(COMM_ST_ADDRESS);
	for(i=0;i<6;i++)
	{
		j=ht1621_buff[i];
		lcd_write_byte(j);
	}
	lcd_input_over();
}

/****************************************************************/
//函数名：
//功  能：设置全屏信息ht1621_buff[]中6个字节
//参  数：无
//返回值：无
/****************************************************************/
void lcd_set_info(void)
{
	lcd_set_cct();
	lcd_set_lm();
	
}
/****************************************************************/
//函数名：
//功  能：设置cct信息ht1621_buff[]中0--3共4个字节
//参  数：无
//返回值：cct_buff[0--3]转换--->ht1621_buff[0--3]
/****************************************************************/
void lcd_set_cct(void)
{
	uint8_t i,j;
	uint8_t code *ptr;
	
	for(i=0;i<4;i++)
	{
		ptr=lcd_num0;
		j=cct_buff[i];
		if(j>0x10)
		{
			j=0x10;
		}
		ptr=ptr+j;
		ht1621_buff[i]=*ptr;
	}
	SET_S1;
	SET_S2;
}
/****************************************************************/
//函数名：
//功  能：设置lm信息ht1621_buff[]中4--5共2个字节
//参  数：无
//返回值：lm_buff[0--2]转换--->ht1621_buff[4--5]
//先设cct信息,再设lm信息,否则覆盖
/****************************************************************/
void lcd_set_lm(void)
{
	uint8_t i,j;
	uint8_t code *ptr;

	if(lm_buff[0])
	{
		lm_buff[1]=0;
		lm_buff[2]=0;
		for(i=0;i<2;i++)
		{
			ptr=lcd_num1;
			j=lm_buff[i+1];
			if(j>0x10)
			{
				j=0x10;
			}
			ptr=ptr+j;
			ht1621_buff[5-i]=*ptr;
		
		}
		SET_S3;
		SET_S4;

		SET_7B;
		SET_7C;
	}
	else
	{
		if(lm_buff[1])
		{
			for(i=0;i<2;i++)
			{
				ptr=lcd_num1;
				j=lm_buff[i+1];
				if(j>0x10)
				{
					j=0x10;
				}
				ptr=ptr+j;
				ht1621_buff[5-i]=*ptr;
			}
			SET_S3;
			SET_S4;

			RESET_7B;
			RESET_7C;
		}
		else
		{
			ptr=lcd_num1;
			j=0x10;
			ptr=ptr+j;
			ht1621_buff[5]=*ptr;

			ptr=lcd_num1;
			j=lm_buff[2];
			ptr=ptr+j;
			ht1621_buff[4]=*ptr;
			
			SET_S3;
			SET_S4;
			
			RESET_7B;
			RESET_7C;
		}
	}
}



